<a href="https://colab.research.google.com/github/wangye9999/demo/blob/master/Module1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
grocery_data={
    'mike':[5, 1, 3, 4],
    'Bananas':[6,4,2,1],
    'Fish':[1,0,3,2],
    'Egg':[0,4,6,9]
}

In [ ]:
Costco_item = pd.DataFrame(grocery_data)
Costco_item

   mike  Bananas  Fish  Egg
0     5        6     1    0
1     1        4     0    4
2     3        2     3    6
3     4        1     2    9

In [ ]:
Costco_item=pd.DataFrame(grocery_data, index=['Jawad','Caleb','Lee','Joe'])

In [ ]:
Costco_item

       mike  Bananas  Fish  Egg
Jawad     5        6     1    0
Caleb     1        4     0    4
Lee       3        2     3    6
Joe       4        1     2    9

In [ ]:
#loc can do filter by rows only.
Costco_item.loc['Lee']

mike       3
Bananas    2
Fish       3
Egg        6
Name: Lee, dtype: int64

In [ ]:
Costco_item.to_csv('Costco_item.csv')

In [ ]:
data_costco=pd.read_csv('/content/Costco_item.csv')
data_costco

  Unnamed: 0  mike  Bananas  Fish  Egg
0      Jawad     5        6     1    0
1      Caleb     1        4     0    4
2        Lee     3        2     3    6
3        Joe     4        1     2    9

In [14]:
df=pd.read_csv('https://raw.githubusercontent.com/peetck/IMDB-Top1000-Movies/master/IMDB-Movie-Data.csv',index_col="Title")
df.head(5)

                         Rank  ... Metascore
Title                          ...
Guardians of the Galaxy     1  ...        76
Prometheus                  2  ...        65
Split                       3  ...        62
Sing                        4  ...        59
Suicide Squad               5  ...        40

[5 rows x 11 columns]

In [16]:
print(df.Genre.head(2))
print("------------------")

Title
Guardians of the Galaxy     Action,Adventure,Sci-Fi
Prometheus                 Adventure,Mystery,Sci-Fi
Name: Genre, dtype: object
------------------

In [17]:
print(df[['Year', 'Rating', 'Votes']].head(2))

                         Year  Rating   Votes
Title
Guardians of the Galaxy  2014     8.1  757074
Prometheus               2012     7.0  485820

In [15]:
print(df.iloc[:,-3:].head(2))

                          Votes  Revenue (Millions)  Metascore
Title
Guardians of the Galaxy  757074              333.13         76
Prometheus               485820              126.46         65

In [18]:
#print the first two rows of genre
print(df.Genre.head(2))
print("------------------")

#print the first two rows of the selected columns
print(df[['Year', 'Rating', 'Votes']].head(2))

#print the last three columns. The last one is -1.
print(df.iloc[:,-3:].head(2))

Title
Guardians of the Galaxy     Action,Adventure,Sci-Fi
Prometheus                 Adventure,Mystery,Sci-Fi
Name: Genre, dtype: object
------------------
                         Year  Rating   Votes
Title
Guardians of the Galaxy  2014     8.1  757074
Prometheus               2012     7.0  485820
                          Votes  Revenue (Millions)  Metascore
Title
Guardians of the Galaxy  757074              333.13         76
Prometheus               485820              126.46         65

In [19]:
#string is indicated as object
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, Guardians of the Galaxy to Nine Lives
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Genre               1000 non-null   object
 2   Description         1000 non-null   object
 3   Director            1000 non-null   object
 4   Actors              1000 non-null   object
 5   Year                1000 non-null   int64
 6   Runtime (Minutes)   1000 non-null   int64
 7   Rating              1000 non-null   float64
 8   Votes               1000 non-null   int64
 9   Revenue (Millions)  1000 non-null   float64
 10  Metascore           1000 non-null   int64
dtypes: float64(2), int64(5), object(4)
memory usage: 133.8+ KB

In [20]:
df.shape

(1000, 11)

In [21]:
df.columns

Index(['Rank', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [25]:
#basic descriptive statistics
df.describe()

              Rank         Year  ...  Revenue (Millions)    Metascore
count  1000.000000  1000.000000  ...         1000.000000  1000.000000
mean    500.500000  2012.783000  ...           72.337960    58.843000
std     288.819436     3.205962  ...          100.320314    17.074891
min       1.000000  2006.000000  ...            0.000000    11.000000
25%     250.750000  2010.000000  ...            3.352500    47.000000
50%     500.500000  2014.000000  ...           37.145000    59.000000
75%     750.250000  2016.000000  ...           99.177500    72.000000
max    1000.000000  2016.000000  ...          936.630000   100.000000

[8 rows x 7 columns]

In [30]:
df.rename(columns={'Runtime(Minutes)':'Runtime', 'Revenue(Millions)':'Revenue'}, inplace=True)

In [31]:
df.describe()

              Rank         Year  ...  Revenue (Millions)    Metascore
count  1000.000000  1000.000000  ...         1000.000000  1000.000000
mean    500.500000  2012.783000  ...           72.337960    58.843000
std     288.819436     3.205962  ...          100.320314    17.074891
min       1.000000  2006.000000  ...            0.000000    11.000000
25%     250.750000  2010.000000  ...            3.352500    47.000000
50%     500.500000  2014.000000  ...           37.145000    59.000000
75%     750.250000  2016.000000  ...           99.177500    72.000000
max    1000.000000  2016.000000  ...          936.630000   100.000000

[8 rows x 7 columns]

In [32]:
df.columns

Index(['Rank', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')